handlers/product-switch-api/test/fixtures/pendingAmendments.json

{
  "success": true,
  "id": "484848575754829292",
  "accountId": "7575757575757583838383",
  "accountNumber": "A1234",
  "accountName": "00123ASDQWE123",
  "invoiceOwnerAccountId": "7575757575757583838383",
  "invoiceOwnerAccountNumber": "A1234",
  "invoiceOwnerAccountName": "00123ASDQWE123",
  "subscriptionNumber": "A-S12345984",
  "version": 5,
  "revision": "5.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2021-11-09",
  "serviceActivationDate": "2021-11-09",
  "customerAcceptanceDate": "2021-11-09",
  "subscriptionStartDate": "2021-11-09",
  "subscriptionEndDate": "2025-11-09",
  "lastBookingDate": "2024-12-05",
  "termStartDate": "2024-11-09",
  "termEndDate": "2025-11-09",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "USD",
  "contractedMrr": 6.25,
  "totalContractedValue": 200,
  "notes": "User updated contribution via self-service MMA. Amount changed from $50.0 to $75.00 effective from 2025-11-09",
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": {
    "id": "348575757575758309202",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United States",
    "county": null,
    "fax": null,
    "state": "New York",
    "postalCode": null,
    "firstName": "Test",
    "lastName": "User",
    "nickname": null,
    "workEmail": "testing@thegulocal.com",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "7575757575757583838383",
    "accountNumber": "A1234",
    "isSpecifiedInSubscription": false
  },
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "id": "348575757575758309202",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United States",
    "county": null,
    "fax": null,
    "state": "New York",
    "postalCode": null,
    "firstName": "Test",
    "lastName": "User",
    "nickname": null,
    "workEmail": "testing@thegulocal.com",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "7575757575757583838383",
    "accountNumber": "A1234",
    "isSpecifiedInSubscription": false
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "48586020209395",
      "lastChangeType": "Update",
      "productId": "2c92a0fe5aacfabe015ad24bf6e15ff6",
      "productName": "Contributor",
      "productSku": "ABC-00000028",
      "productRatePlanId": "2c92a0fc5e1dc084015e37f58c200eea",
      "productRatePlanNumber": null,
      "ratePlanName": "Annual Contribution",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-1234",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "69393443553527344",
          "originalChargeId": "697979789898965",
          "productRatePlanChargeId": "2c92a0fc5e1dc084015e37f58c7b0f34",
          "number": "C-1234",
          "name": "Annual Contribution",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 5,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 2,
          "effectiveStartDate": "2025-11-09",
          "effectiveEndDate": "2025-11-09",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": null,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 6.25,
          "dmrc": 2.083333333,
          "tcv": 0,
          "dtcv": 0,
          "originalOrderDate": "2024-12-05",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 75,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "USD75",
          "price": 75,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-123445",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2021-11-09",
      "endDate": "2025-11-09",
      "status": "Active"
    },
    {
      "startDate": "2025-11-09",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2024-12-05 22:42:06",
  "updateTime": "2024-12-05 22:42:06",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}